# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


n = int(input('Введите трехзначное число '))

number_1 = n // 100
number_2 = n // 10 % 10
number_3 = n % 10
print(number_1 + number_2 + number_3)



